---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.AddBuilding(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/4ab99c64-1699-25d5-6ece-bdd5994a1727.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.AddBuilding Method

Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.

## Syntax (C#)
```csharp
public void AddBuilding(
	IFCAnyHandle buildingHandle
)
```

## Parameters
- **buildingHandle** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The IfcBuilding handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null